<a href="https://colab.research.google.com/github/ypushpa9420/FDS-Lab-PG1/blob/main/FDS_La1_Ass_Pushpa_Yadav.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Mounting Google Drive
%cd ..
from google.colab import drive
drive.mount('/content/gdrive')

/
Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
import pandas as pd
Location="/content/gdrive/MyDrive/employees.csv"
EmpId = ["E101","E102","E103","E104"]
FName = ["Shweta","Manisha","Madhu","Anita"]
LName = ["Subnis","Perdesi","Mali","Rai"]
Designation = ["ProjectEngineer","Tester","SrSoftwareEngineer","WebDeveloper"]
Basic_Salary = [40000,50000,60000,70000]
Employee = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['Employee id','First Name','Last Name','Designation','Basic Salary']
df = pd.DataFrame(data = Employee, columns=column)
df.to_csv(Location, index=False)
df = pd.read_csv(Location)
df

  Employee id First Name Last Name         Designation  Basic Salary
0        E101     Shweta    Subnis     ProjectEngineer         40000
1        E102    Manisha   Perdesi              Tester         50000
2        E103      Madhu      Mali  SrSoftwareEngineer         60000
3        E104      Anita       Rai        WebDeveloper         70000

In [ ]:
pip install xlsxwriter

Requirement already satisfied: xlsxwriter in /usr/local/lib/python3.6/dist-packages (1.3.7)

In [ ]:
import xlsxwriter
import pandas as pd
Location1="/content/gdrive/MyDrive/employees1.xlsx"
EmpId = ["E101","E102","E103","E104"]
FName = ["Shweta","Manisha","Madhu","Anita"]
LName = ["Subnis","Perdesi","Mali","Rai"]
Designation = ["ProjectEngineer","Tester","SrSoftwareEngineer","WebDeveloper"]
Basic_Salary = [40000,50000,60000,70000]
Employee = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['Emp id','First Name','Last Name','Designation','Basic Salary']
df1 = pd.DataFrame(data = Employee, columns=column)

writer = pd.ExcelWriter(Location1, engine='xlsxwriter')
df1.to_excel(writer, sheet_name='Sheet1', index=False)
writer.save()
df1 = pd.read_excel(Location1)
df1

  Emp id First Name Last Name         Designation  Basic Salary
0   E101     Shweta    Subnis     ProjectEngineer         40000
1   E102    Manisha   Perdesi              Tester         50000
2   E103      Madhu      Mali  SrSoftwareEngineer         60000
3   E104      Anita       Rai        WebDeveloper         70000

In [ ]:
import os
import sqlite3 as lite
import pandas as pd
EmpId = ["E101","E102","E103","E104"]
FName = ["Shweta","Manisha","Madhu","Anita"]
LName = ["Subnis","Perdesi","Mali","Rai"]
Designation = ["ProjectEngineer","Tester","SrSoftwareEngineer","WebDeveloper"]
Basic_Salary = [40000,50000,60000,70000]
Employee = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['Employees id','First Name','Last Name','Designation','Basic Salary']
df2 = pd.DataFrame(data = Employee, columns=column)
db_employees = r'/content/gdrive/MyDrive/mydbass1.db'
con = lite.connect(db_employees)
df2.to_sql('employees',con,
schema=None,
if_exists='replace',
index=False,
index_label=None,
chunksize=None,
dtype=None)
con.close()

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
# Connect to sqlite db
db_file = r'/content/gdrive/MyDrive/mydbass1.db'
engine = create_engine(r"sqlite:///{}" .format(db_file))
sql = 'SELECT * from employees'
df2 = pd.read_sql(sql, engine)
df2

  Employees id First Name Last Name         Designation  Basic Salary
0         E101     Shweta    Subnis     ProjectEngineer         40000
1         E102    Manisha   Perdesi              Tester         50000
2         E103      Madhu      Mali  SrSoftwareEngineer         60000
3         E104      Anita       Rai        WebDeveloper         70000